# ============================================
# مشروع 2: حاسبة مؤشر كتلة الجسم والتقييم الصحي
# ============================================
print("=== مرحباً بك في نظام الفحص الصحي الذكي ===")
name=input("أدخل اسمك: ")
weight=float(input("أدخل وزنك بالكيلوجرام (مثال: 75.5): "))
height_cm=float(input("أدخل طولك بالسنتيمتر (مثال: 175): "))
# 2. تحويل الطول إلى أمتار وحساب BMI
height_m=height_cm /100
bmi=weight / (height_m ** 2)
print("\n--------------------------------")
print(f"أهلاً بك يا {name}، مؤشر كتلة جسمك (BMI) هو: {bmi:.1f}")
# 3. اتخاذ القرار باستخدام if / elif / else
if bmi < 18.5:
    status = "نقص في الوزن (Underweight)"
    advice = "ينصح بزيادة السعرات الحرارية وتناول وجبات مغذية."
elif 18.5 <= bmi < 25:
    status = "وزن مثالي ورائع (Normal)"
    advice = "ممتاز! حافظ على نظامك الغذائي ونشاطك البدني."
elif 25 <= bmi < 30:
    status = "زيادة في الوزن (Overweight)"
    advice = "ينصح بممارسة الرياضة وتقليل السعرات الحرارية."
else:
    status = "سمنة (Obesity)"
    advice = "يُوصى بمراجعة أخصائي تغذية والبدء في برنامج رياضي مكثف."

# 4. طباعة التقرير النهائي
print(f"التقييم الصحي: {status}")
print(f"النصيحة: {advice}")
print("--------------------------------")